---
kind: method
id: M:Autodesk.Revit.DB.DocumentDifference.Dispose
source: html/0a5c5449-f9f7-48d4-3e85-f96e1dd89f0a.htm
---
# Autodesk.Revit.DB.DocumentDifference.Dispose Method

Releases all resources used by the DocumentDifference

## Syntax (C#)
```csharp
public void Dispose()
```